---
type: AssemblyCodeTable
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# AssemblyCodeTable

`Autodesk.Revit.DB.AssemblyCodeTable` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetAssemblyCodeTable | 2015 | `public static AssemblyCodeTable GetAssemblyCodeTable ( Document doc )` |
| Property | Parameter | — | `` |